# -*- coding: utf-8 -*-
import os
import pytest
from src.Types import DataType
from src.DataReaderXML import DataReaderXML


class TestDataReaderXML:
    @pytest.fixture()
    def file_and_data_content(self) -> tuple[str, DataType]:
        root_dir = os.path.dirname(os.path.abspath(__file__))
        file_path = f'{root_dir}/data/data.xml'

        data = {
            'Иванов Иван Иванович':
                [('математика', 67),
                 ('литература', 100.0),
                 ('программирование', 91.0)],
            'Петров Петр Петрович':
                [('математика', 78),
                 ('химия', 87.0),
                 ('социология', 61.0)],
            'Сидоров Сидор Сидорович':
                [('математика', 90),
                 ('физика', 85.0),
                 ('биология', 75.0)],
            'Козлова Анна Игоревна':
                [('математика', 95),
                 ('химия', 93.0),
                 ('физика', 88.0)],
            'Смирнов Алексей Александрович':
                [('математика', 82),
                 ('литература', 76.0),
                 ('история', 89.0)],
            'Васильева Екатерина Викторовна':
                [('математика', 70),
                 ('английский', 92.0),
                 ('география', 84.0)],
            'Михайлов Дмитрий Петрович':
                [('математика', 88),
                 ('биология', 79.0),
                 ('история', 67.0)],
            'Кузнецова Ольга Сергеевна':
                [('математика', 75),
                 ('социология', 72.0),
                 ('английский', 91.0)],
            'Лебедев Артем Алексеевич':
                [('математика', 94),
                 ('программирование', 96.0),
                 ('физика', 87.0)],
            'Андреева Мария Андреевна':
                [('математика', 80),
                 ('литература', 85.0),
                 ('география', 73.0)]}
        return file_path, data

    def test_read(self, file_and_data_content: tuple[str, DataType]) -> None:
        file_content = DataReaderXML().read(file_and_data_content[0])
        assert file_content == file_and_data_content[1]
